# GetLoadClassificationConnectedLoad Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetLoadClassificationConnectedLoad Method
PanelScheduleView Class See Also
---
Gets the Total Load for given Load Classification
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string GetLoadClassificationConnectedLoad(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function GetLoadClassificationConnectedLoad ( _
	nRow As Integer, _
	nCol As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetLoadClassificationConnectedLoad(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row number of Load Summary Section
nCol
    Type: System..::..Int32 Column number of Load Summary Section
# ### Return Value
The total load for the given Load Classification
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary. |

# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace